In [ ]:
# Task1_0527. 4개의 Series를 결합하여 데이터프레임을 생성하여 출력하세요.
# - 출력한 데이터프레임에서 추출하고 싶은 5개의 데이터를 인덱싱하여 출력
# - null값을 3개 추가
# - null값의 개수를 확인하고 삭제
# - 2개의 데이터를 수정
# - 1개의 행을 삭제


# (i) 4개의 Series를 결합하여 데이터프레임을 생성하여 출력하세요.
persData1=('Hwooks','96', 46, '남', '1978.01.18'); sr1=pd.Series(persData1)
persData2=('John','00', 42, '남', '1982.01.18'); sr2=pd.Series(persData2)
persData3=('James','11', 31, '여', '1993.01.18'); sr3=pd.Series(persData3)
persData4=('Jane','23', 19, '여', '2005.01.18'); sr4=pd.Series(persData4)
df=pd.concat([sr1, sr2, sr3, sr4], axis=1)
df.index=['name','학번', '나이','성별', '생년월일']
df.columns=['person1','person2','person3','person4']
print(df)
print()

# (ii) 출력한 데이터프레임에서 추출하고 싶은 5개의 데이터를 인덱싱하여 출력
print(df.iloc[0,0])
print(df.iloc[0,3])
print(df.loc['학번','person3'])
# print(df.iloc['학번','person3']) ## 에러 발생
print(df.iloc[1,1])
#print(df.loc[1,1])               ## 에러 발생
#print(df.iloc[0,'person1'])      ## 에러 발생
print(df.iloc[0:4,0])
print(df.iloc[:])
#print(df.at[0,'person1'])         ## 에러발생
print(df.at['학번','person1'])
print(df.iloc[2,3])
#print(df.at[2,3])                  ## 에러 발생 ==> at을 iloc 처럼은 못쓴다.

## (iii) null값을 3개 추가
df.iloc[1,3]=None
df.iloc[2,1]=np.nan
df.iloc[4,0]=None

print(df)

# (iv) null값의 개수를 확인하고 삭제
numNull=df.isnull().sum()           ## 이렇게 하면 column별 null 값을 반환
print(numNull)
numNull=df.isnull().sum().sum()     ## 두번해야지 전체 null 값을 반환
print(numNull)

numNull=df.iloc[:,0].isnull().sum()           ## 1st column별 null 값을 반환
print(numNull)

numNull=df.iloc[:,1].isnull().sum()           ## 2nd column별 null 값을 반환
print(numNull)

numNull=df.iloc[:,2].isnull().sum()           ## 3rd column별 null 값을 반환
print(numNull)

numNull=df.iloc[:,3].isnull().sum()           ## 4th column별 null 값을 반환
print(numNull)

numNull=df.iloc[0].isnull().sum()           ## 이렇게 하면 1st 열 null 값을 반환
print(numNull)
numNull=df.iloc[1].isnull().sum()           ## 이렇게 하면 2nd 열 null 값을 반환
print(numNull)
numNull=df.iloc[2].isnull().sum()           ## 이렇게 하면 3rd 열 null 값을 반환
print(numNull)
numNull=df.iloc[3].isnull().sum()           ## 이렇게 하면 4th 열 null 값을 반환
print(numNull)
numNull=df.iloc[4].isnull().sum()           ## 이렇게 하면 5th 열 null 값을 반환
print(numNull)


filled_df=df.fillna(0)
print(filled_df)
# (v) 2개의 데이터를 수정
df.iloc[1,3]='23'
df.iloc[2,1]=42
df.iloc[4,0]='1978.01.18'

# (vi) 1개의 행을 삭제
#df.drop(['person2'], axis=1, inplace=True)           ## 가능
#df.drop([0], axis=0, inplace=True)                    ## Error label로만 indexing 가능
df.drop(["학번"], axis=0, inplace=True)              ## 가능
print(df)

         person1     person2     person3     person4
name      Hwooks        John       James        Jane
학번            96          00          11          23
나이            46          42          31          19
성별             남           남           여           여
생년월일  1978.01.18  1982.01.18  1993.01.18  2005.01.18

Hwooks
Jane
11
00
name    Hwooks
학번          96
나이          46
성별           남
Name: person1, dtype: object
         person1     person2     person3     person4
name      Hwooks        John       James        Jane
학번            96          00          11          23
나이            46          42          31          19
성별             남           남           여           여
생년월일  1978.01.18  1982.01.18  1993.01.18  2005.01.18
96
19
     person1     person2     person3     person4
name  Hwooks        John       James        Jane
학번        96          00          11        None
나이        46         NaN          31          19
성별         남           남           여           여
생년월일    None  1982.01.18  1993.01.18  2005.01.18
person1    1
person2    1
person3    0
person4    1
dtype: int64
3
1
1
0
1
0
1
1
0
1
     person1     person2     person3     person4
name  Hwooks        John       James        Jane
학번        96          00          11           0
나이        46           0          31          19
성별         남           남           여           여
생년월일       0  1982.01.18  1993.01.18  2005.01.18
         person1     person2     person3     person4
name      Hwooks        John       James        Jane
나이            46          42          31          19
성별             남           남           여           여
생년월일  1978.01.18  1982.01.18  1993.01.18  2005.01.18

In [ ]:
# Task2_0527. 학생별 성적 데이터셋으로 의미있게 데이터 셋을 수정하세요.(아래 사항 반영)
# - S1 ~ S10은 평균 점수를 기준으로 1등급에서 10등급이고 등급간 점수 차는 5점
# - 결시자가 국어 3명, 수학 2명 있음
# - 영어, 수학의 평균 점수가 국어 대비 5점 낮음
import pandas as pd
import numpy as np
df = np.random.randint(1,5,size=(10,5))
df=pd.DataFrame(df,index=['s1','s2','s3','s4','s5','s6','s7','s8','s9','s10'],
               columns=['국어','영어','수학','과학','사회'])
df

In [ ]:
# Task3_0527. df1에서 결측값 처리 후 딕셔너리, 리스트로 변환하여 출력하세요.
df1 = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Math": [85, np.nan, 88, 90, 76],
    "English": [92, 85, 89, np.nan, 80],
    "Science": [78, 90, 95, 85, 89],
    "History": [88, 92, 85, 91, np.nan]
})

In [ ]:
# Task4_0527. df2에서 아래와 같이 데이터 필터링 및 정렬 후 배열, 딕셔너리, 리스트로 변환하여 출력하세요.
# - Math 점수가 80 이상인 학생만 선택
# - English 점수를 기준으로 내림차순 정렬
df2 = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Math": [85, 79, 88, 90, 76],
    "English": [92, 85, 89, 93, 80],
    "Science": [78, 90, 95, 85, 89],
    "History": [88, 92, 85, 91, 84]
})

In [ ]:
# Task5_0527. df3에서 각 학생의 평균 점수 계산 후 배열, 딕셔너리, 리스트로 변환하여 출력하세요.
df3 = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice", "Bob", "Charlie", "David", "Eve"],
    "Subject": ["Math", "Math", "Math", "Math", "Math", "English", "English", "English", "English", "English"],
    "Score": [85, 79, 88, 90, 76, 92, 85, 89, 93, 80]
})

In [ ]:
# Task6_0527. df4에서 특정 열의 데이터 타입을 변환한 후 변환된 타입을 확인하세요.
df4 = pd.DataFrame({
    'A': ['1', '2', '3', '4'],
    'B': ['5.1', '6.2', '7.3', '8.4'],
    'C': ['2021-01-01', '2021-02-01', '2021-03-01', '2021-04-01']
})

In [ ]:
# Task7_0527. df5에서 나이가 25 이상인 행을 출력하세요.
df5 = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [24, 27, 22, 32, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
})